; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v5 ?v11)
             (pred_9 ?v10 ?v7)
             (pred_11 ?v5 ?v7)
             (pred_4 ?v12 ?v5 )
	     (pred_3 ?v5)
             (pred_12 ?v3)
             (pred_5 ?v10)
             (pred_10 ?v7)
             (pred_1 ?v5)
             (pred_7 ?v10)
             (pred_6 ?v5)
             (pred_8 ))



(:action op_5
:parameters (?v4 ?v1 ?v2 ?v6)
:precondition (and (pred_12 ?v4) (pred_12 ?v1) (pred_5 ?v2) (pred_10 ?v6)
          (pred_2 ?v4 ?v1) (pred_9 ?v2 ?v6)
                   (pred_11 ?v1 ?v6) (pred_3 ?v4) 
                   (pred_1 ?v1) (pred_7 ?v2))
:effect (and  (pred_6 ?v1) (not (pred_1 ?v1))))


(:action op_4
:parameters (?v4 ?v13)
:precondition (and (pred_12 ?v4) (pred_12 ?v13)
               (pred_3 ?v4) (pred_2 ?v4 ?v13) (pred_6 ?v13))
:effect (and (pred_3 ?v13) (not (pred_3 ?v4))))

(:action op_1
:parameters (?v4 ?v2)
:precondition (and (pred_12 ?v4) (pred_5 ?v2) 
                  (pred_3 ?v4) (pred_4 ?v2 ?v4) (pred_8 ))
:effect (and (pred_7 ?v2)
   (not (pred_4 ?v2 ?v4)) (not (pred_8 ))))


(:action op_3
:parameters (?v4 ?v8 ?v9)
:precondition (and (pred_12 ?v4) (pred_5 ?v8) (pred_5 ?v9)
                  (pred_3 ?v4) (pred_7 ?v9) (pred_4 ?v8 ?v4))
:effect (and (pred_7 ?v8) (pred_4 ?v9 ?v4)
        (not (pred_7 ?v9)) (not (pred_4 ?v8 ?v4))))

(:action op_2
:parameters (?v4 ?v2)
:precondition (and (pred_12 ?v4) (pred_5 ?v2) 
                  (pred_3 ?v4) (pred_7 ?v2))
:effect (and (pred_8 ) (pred_4 ?v2 ?v4) (not (pred_7 ?v2)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_17 obj_12 obj_06 obj_05 obj_09 obj_04 obj_20 obj_07 obj_10 obj_02 obj_16 obj_08 obj_14 obj_11 obj_13 obj_19
    obj_15 obj_01
    obj_18 obj_03
    )

    (:init
       (pred_8)

       (pred_12 obj_17)
       (pred_12 obj_12)
       (pred_12 obj_06)
       (pred_12 obj_05)
       (pred_12 obj_09)
       (pred_12 obj_04)
       (pred_12 obj_20)
       (pred_12 obj_07)
       (pred_12 obj_10)
       (pred_12 obj_02)
       (pred_12 obj_16)
       (pred_12 obj_08)
       (pred_12 obj_14)
       (pred_12 obj_11)
       (pred_12 obj_13)
       (pred_12 obj_19)
       (pred_10 obj_15)
       (pred_10 obj_01)
       (pred_5 obj_18)
       (pred_5 obj_03)

       (pred_2 obj_17 obj_09)
       (pred_2 obj_17 obj_12)
       (pred_2 obj_12 obj_04)
       (pred_2 obj_12 obj_06)
       (pred_2 obj_12 obj_17)
       (pred_2 obj_06 obj_20)
       (pred_2 obj_06 obj_05)
       (pred_2 obj_06 obj_12)
       (pred_2 obj_05 obj_07)
       (pred_2 obj_05 obj_06)
       (pred_2 obj_09 obj_10)
       (pred_2 obj_09 obj_04)
       (pred_2 obj_09 obj_17)
       (pred_2 obj_04 obj_02)
       (pred_2 obj_04 obj_20)
       (pred_2 obj_04 obj_12)
       (pred_2 obj_04 obj_09)
       (pred_2 obj_20 obj_16)
       (pred_2 obj_20 obj_07)
       (pred_2 obj_20 obj_06)
       (pred_2 obj_20 obj_04)
       (pred_2 obj_07 obj_08)
       (pred_2 obj_07 obj_05)
       (pred_2 obj_07 obj_20)
       (pred_2 obj_10 obj_14)
       (pred_2 obj_10 obj_02)
       (pred_2 obj_10 obj_09)
       (pred_2 obj_02 obj_11)
       (pred_2 obj_02 obj_16)
       (pred_2 obj_02 obj_04)
       (pred_2 obj_02 obj_10)
       (pred_2 obj_16 obj_13)
       (pred_2 obj_16 obj_08)
       (pred_2 obj_16 obj_20)
       (pred_2 obj_16 obj_02)
       (pred_2 obj_08 obj_19)
       (pred_2 obj_08 obj_07)
       (pred_2 obj_08 obj_16)
       (pred_2 obj_14 obj_11)
       (pred_2 obj_14 obj_10)
       (pred_2 obj_11 obj_13)
       (pred_2 obj_11 obj_02)
       (pred_2 obj_11 obj_14)
       (pred_2 obj_13 obj_19)
       (pred_2 obj_13 obj_16)
       (pred_2 obj_13 obj_11)
       (pred_2 obj_19 obj_08)
       (pred_2 obj_19 obj_13)
       (pred_1 obj_04)
       (pred_1 obj_17)
       (pred_11  obj_04 obj_15)
       (pred_11  obj_17 obj_01)
       (pred_6 obj_12)
       (pred_6 obj_06)
       (pred_6 obj_05)
       (pred_6 obj_09)
       (pred_6 obj_20)
       (pred_6 obj_07)
       (pred_6 obj_10)
       (pred_6 obj_02)
       (pred_6 obj_16)
       (pred_6 obj_08)
       (pred_6 obj_14)
       (pred_6 obj_11)
       (pred_6 obj_13)
       (pred_6 obj_19)

       (pred_9  obj_18 obj_15)
       (pred_9  obj_03 obj_01)
       (pred_4 obj_18 obj_12)
       (pred_4 obj_03 obj_09)
       (pred_3 obj_06)
    )

    (:goal (and
       (pred_4 obj_03 obj_10)
    ))
(:constraints
  (always (not (pred_3 obj_16)))
)
)

; plan
1. (op_4 obj_06 obj_12)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_12)
   goals met: 0 of 1
2. (op_1 obj_12 obj_18)
   deleted: (pred_4 obj_18 obj_12) (pred_8)
   added: (pred_7 obj_18)
   goals met: 0 of 1
3. (op_5 obj_12 obj_04 obj_18 obj_15)
   deleted: (pred_1 obj_04)
   added: (pred_6 obj_04)
   goals met: 0 of 1
4. (op_4 obj_12 obj_04)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_04)
   goals met: 0 of 1
5. (op_4 obj_04 obj_09)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_09)
   goals met: 0 of 1
6. (op_3 obj_09 obj_03 obj_18)
   deleted: (pred_7 obj_18) (pred_4 obj_03 obj_09)
   added: (pred_7 obj_03) (pred_4 obj_18 obj_09)
   goals met: 0 of 1
7. (op_4 obj_09 obj_10)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_10)
   goals met: 0 of 1
8. (op_2 obj_10 obj_03)
   deleted: (pred_7 obj_03)
   added: (pred_8) (pred_4 obj_03 obj_10)
   goals met: 1 of 1
